# !user/bin/python
# -*- coding: UTF-8 -*-

import pandas as pd
import numpy as np

# 将小于50的替换成999
# 思路一，先用df[df > 50]将小于50的换成NaN，再用fillna
# 思路二，用applymap函数，df.applymap(lambda x : 999 if x < 50 else x)
df = pd.DataFrame(np.round(np.random.rand(6, 4) * 100))
print(df)
#       0     1     2     3
# 0  85.0  17.0  37.0  44.0
# 1  84.0  93.0  87.0  53.0
# 2  53.0  36.0  20.0  53.0
# 3  96.0  33.0  27.0  61.0
# 4  31.0  34.0  19.0  36.0
# 5  62.0  15.0  78.0  96.0
print(df[df > 50])
#       0     1     2     3
# 0  85.0   NaN   NaN   NaN
# 1  84.0  93.0  87.0  53.0
# 2  53.0   NaN   NaN  53.0
# 3  96.0   NaN   NaN  61.0
# 4   NaN   NaN   NaN   NaN
# 5  62.0   NaN  78.0  96.0
print(df[df > 50].fillna(999))
#        0      1      2      3
# 0   85.0  999.0  999.0  999.0
# 1   84.0   93.0   87.0   53.0
# 2   53.0  999.0  999.0   53.0
# 3   96.0  999.0  999.0   61.0
# 4  999.0  999.0  999.0  999.0
# 5   62.0  999.0   78.0   96.0

# 下面的范式起到了一样的效果
print(df.applymap(lambda x : 999 if x < 50 else x))
#        0      1      2      3
# 0   85.0  999.0  999.0  999.0
# 1   84.0   93.0   87.0   53.0
# 2   53.0  999.0  999.0   53.0
# 3   96.0  999.0  999.0   61.0
# 4  999.0  999.0  999.0  999.0
# 5   62.0  999.0   78.0   96.0

# replace函数
df2 = pd.DataFrame(np.arange(16).reshape(4, 4))
print(df2)
#     0   1   2   3
# 0   0   1   2   3
# 1   4   5   6   7
# 2   8   9  10  11
# 3  12  13  14  15

# 将15替换成100
print(df2.replace({15 : 100}))
#     0   1   2    3
# 0   0   1   2    3
# 1   4   5   6    7
# 2   8   9  10   11
# 3  12  13  14  100